In [1]:
import pandas

In [2]:
pandas.__version__

'1.5.2'

In [7]:
dict1 = {
    'names': ['vision', 'nit', 'it trainers', 'ali'],
    'address': ['mardan', 'charsadda', 'peshawar', 'swat'],
    'contact': [312, 313, 314, 315]
}
df = pandas.DataFrame(dict1)
df

         names    address  contact
0       vision     mardan      312
1          nit  charsadda      313
2  it trainers   peshawar      314
3          ali       swat      315

In [8]:
import pandas as pd

In [10]:
mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

myvar = pd.DataFrame(mydataset)

myvar

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [15]:
a = [1, 7, 2, 3]
b = ['a', 'b','c']

myvar = pd.Series(a)
myvar1 = pd.Series(b)

myvar

0    1
1    7
2    2
3    3
dtype: int64

In [12]:
type(myvar)

pandas.core.series.Series

In [16]:
myvar1

0    a
1    b
2    c
dtype: object

In [18]:
myvar1[2]

'c'

In [25]:
a = [1, 7, 2]

myvar = pd.Series(a, index = ["x", "y", "z"])

print(myvar)

x    1
y    7
z    2
dtype: int64

In [23]:
myvar['z']

2

In [26]:
calories = {"day1": 420, "day2": 380, "day3": 390}

myvar = pd.Series(calories)

print(myvar)

day1    420
day2    380
day3    390
dtype: int64

In [27]:
myvar['day3']

390

In [28]:
calories = {"day1": 420, "day2": 380, "day3": 390}

myvar = pd.Series(calories, index = ["day1", "day2"])

print(myvar)

day1    420
day2    380
dtype: int64

In [30]:
data = {
  "calories": [420, 380, 390],
  "duration": [50, 40, 45]
}

#load data into a DataFrame object:
df = pd.DataFrame(data)

df

   calories  duration
0       420        50
1       380        40
2       390        45

In [34]:
print(df.loc[2])

calories    390
duration     45
Name: 2, dtype: int64

In [38]:
a = df.loc[0]
type(a)

pandas.core.series.Series

In [41]:
a = df.loc[[0,1]]
type(a)
a

   calories  duration
0       420        50
1       380        40

In [42]:
df = pd.read_csv('Attendence.csv')

In [43]:
df

,GOVT POST GRADUATE COLLEGE MARDAN,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8
0,Students Attendence Performa for Shortage Sess...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Class,1st Year,Section: ___,Subject: ________,Prof. Name,__________________,NaN,NaN,NaN
3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...
78,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
79,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
80,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
81,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
82,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [44]:
df = pd.read_excel('Attendence.xlsx')

ImportError: Missing optional dependency 'openpyxl'.  Use pip or conda to install openpyxl.

In [46]:
df = pd.read_csv('data.csv')

In [50]:
df

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

In [51]:
df.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

In [52]:
df.head(10)

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0
5        60    102       127     300.0
6        60    110       136     374.0
7        45    104       134     253.3
8        30    109       133     195.1
9        60     98       124     269.0

In [53]:
df.tail()

     Duration  Pulse  Maxpulse  Calories
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

In [54]:
df.tail(5)

     Duration  Pulse  Maxpulse  Calories
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

In [55]:
pd.options.display.max_rows

60